{
  "_name_or_path": "vinai/phobert-base",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ORGANIZATION",
    "2": "O-ORGANIZATION",
    "3": "I-ORGANIZATION",
    "4": "B-LOCATION",
    "5": "I-LOCATION",
    "6": "B-SYMPTOM_AND_DISEASE",
    "7": "I-SYMPTOM_AND_DISEASE",
    "8": "B-DATE",
    "9": "I-DATE",
    "10": "B-PATIENT_ID",
    "11": "I-PATIENT_ID",
    "12": "B-AGE",
    "13": "I-AGE",
    "14": "B-NAME",
    "15": "I-NAME",
    "16": "B-JOB",
    "17": "I-JOB",
    "18": "B-TRANSPORTATION",
    "19": "I-TRANSPORTATION",
    "20": "B-GENDER"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-AGE": 12,
    "B-DATE": 8,
    "B-GENDER": 20,
    "B-JOB": 16,
    "B-LOCATION": 4,
    "B-NAME": 14,
    "B-ORGANIZATION": 1,
    "B-PATIENT_ID": 10,
    "B-SYMPTOM_AND_DISEASE": 6,
    "B-TRANSPORTATION": 18,
    "I-AGE": 13,
    "I-DATE": 9,
    "I-JOB": 17,
    "I-LOCATION": 5,
    "I-NAME": 15,
    "I-ORGANIZATION": 3,
    "I-PATIENT_ID": 11,
    "I-SYMPTOM_AND_DISEASE": 7,
    "I-TRANSPORTATION": 19,
    "O": 0,
    "O-ORGANIZATION": 2
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tokenizer_class": "PhobertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.12.5",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
